jmeter/秒杀抢购压测.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="秒杀抢购压测"><stringProp name="TestPlan.comments">200 threads x 50 loops; token and coupon_id are command-line properties</stringProp><elementProp name="TestPlan.user_defined_variables" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="target_host" elementType="Argument"><stringProp name="Argument.name">target_host</stringProp><stringProp name="Argument.value">${__P(target_host,localhost)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="target_port" elementType="Argument"><stringProp name="Argument.name">target_port</stringProp><stringProp name="Argument.value">${__P(target_port,8080)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="coupon_id" elementType="Argument"><stringProp name="Argument.name">coupon_id</stringProp><stringProp name="Argument.value">${__P(coupon_id,1)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp><elementProp name="token" elementType="Argument"><stringProp name="Argument.name">token</stringProp><stringProp name="Argument.value">${__P(token,REPLACE_ME)}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp></TestPlan><hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="秒杀 200 并发"><intProp name="ThreadGroup.num_threads">200</intProp><intProp name="ThreadGroup.ramp_time">5</intProp><stringProp name="ThreadGroup.on_sample_error">continue</stringProp><elementProp name="ThreadGroup.main_controller" elementType="LoopController"><stringProp name="LoopController.loops">50</stringProp><boolProp name="LoopController.continue_forever">false</boolProp></elementProp></ThreadGroup><hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP 默认值"><stringProp name="HTTPSampler.domain">${target_host}</stringProp><stringProp name="HTTPSampler.port">${target_port}</stringProp><stringProp name="HTTPSampler.protocol">http</stringProp><stringProp name="HTTPSampler.implementation">HttpClient4</stringProp></ConfigTestElement><hashTree/><HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="鉴权"><collectionProp name="HeaderManager.headers"><elementProp name="" elementType="Header"><stringProp name="Header.name">Authorization</stringProp><stringProp name="Header.value">Bearer ${token}</stringProp></elementProp></collectionProp></HeaderManager><hashTree/><HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="秒杀抢购"><stringProp name="HTTPSampler.path">/user/seckill/coupon/${coupon_id}/orders</stringProp><stringProp name="HTTPSampler.method">POST</stringProp><boolProp name="HTTPSampler.use_keepalive">true</boolProp></HTTPSamplerProxy><hashTree/>
      </hashTree></hashTree>
  </hashTree>
</jmeterTestPlan>